# Programmer:Tayyaba Bagwan
#College:Keystone school of engineering pune 
#class:TE(A)
#Rollno:03

In [12]:
#pandas->structured data analysis 
import pandas as pd
#numpy->array operations
import numpy as np

## array

In [14]:
num=np.array([34,12,37,65,48,79,15])

In [15]:
num

array([34, 12, 37, 65, 48, 79, 15])

In [16]:
type(num)

numpy.ndarray

In [17]:
num.dtype

dtype('int32')

In [18]:
num=np.array([34,12,37,65,48,79,15],dtype=np.int16)

In [19]:
num

array([34, 12, 37, 65, 48, 79, 15], dtype=int16)

In [20]:
num.dtype

dtype('int16')

In [21]:
num[2]

37

In [22]:
####series

In [25]:
S=pd.Series([45,12,38,75,19,36])

In [26]:
S

0    45
1    12
2    38
3    75
4    19
5    36
dtype: int64

In [27]:
type(S)

pandas.core.series.Series

In [30]:
S.dtype

dtype('int64')

In [31]:
S.size

6

In [32]:
S.shape

(6,)

In [37]:
S=pd.Series([45,65,98,75,95,],index=range(100,105))

In [38]:
S

100    45
101    65
102    98
103    75
104    95
dtype: int64

In [39]:
S[104]

95

In [40]:
###data frames

In [53]:
r=pd.Series([1,2,3,4,5])
n=pd.Series(['prem','raj','kiran','priya','asha'])
m=pd.Series([67.89,73.57,66.7,85.5,68.33])

In [54]:
df=pd.DataFrame({ 'roll':r,
                   'name':n,
                    'marks':m
                })

In [55]:
df

   roll   name  marks
0     1   prem  67.89
1     2    raj  73.57
2     3  kiran  66.70
3     4  priya  85.50
4     5   asha  68.33

In [56]:
df.shape

(5, 3)

In [57]:
df.size

15

In [58]:
df.dtypes

roll       int64
name      object
marks    float64
dtype: object

In [59]:
type(df)

pandas.core.frame.DataFrame

In [60]:
import os

In [66]:
df=pd.read_csv('student.csv')

In [67]:
df

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [72]:
df1=pd.read_csv('student1.csv')

In [73]:
df1

    1     anil  TE  56.77  22
0   2     amit  TE  59.77  21
1   3   aniket  BE  76.88  19
2   4  ajinkya  TE  69.66  20
3   5     asha  TE  63.28  20
4   6   ayesha  BE  49.55  20
5   7     amar  BE  65.34  19
6   8    amita  BE  68.33  23
7   9     amol  TE  56.75  20
8  10    anmol  BE  78.66  21

In [76]:
col=['A','B','c','D','E']
df1=pd.read_csv('student1.csv',names=col)

In [77]:
df1

    A        B   c      D   E
0   1     anil  TE  56.77  22
1   2     amit  TE  59.77  21
2   3   aniket  BE  76.88  19
3   4  ajinkya  TE  69.66  20
4   5     asha  TE  63.28  20
5   6   ayesha  BE  49.55  20
6   7     amar  BE  65.34  19
7   8    amita  BE  68.33  23
8   9     amol  TE  56.75  20
9  10    anmol  BE  78.66  21

In [96]:
!pip install openpyxl

Requirement already satisfied: openpyxl in c:\users\itekhar\appdata\local\programs\python\python312\lib\site-packages (3.1.2)
Requirement already satisfied: et-xmlfile in c:\users\itekhar\appdata\local\programs\python\python312\lib\site-packages (from openpyxl) (1.1.0)

In [79]:
df3

  roll\tname\tclass\tmarks\tage
0        1\tanil\tTE\t56.77\t22
1        2\tamit\tTE\t59.77\t21
2      3\taniket\tBE\t76.88\t19
3     4\tajinkya\tTE\t69.66\t20
4        5\tasha\tTE\t63.28\t20
5      6\tayesha\tBE\t49.55\t20
6        7\tamar\tBE\t65.34\t19
7       8\tamita\tBE\t68.33\t23
8        9\tamol\tTE\t56.75\t20
9      10\tanmol\tBE\t78.66\t21

In [93]:
df3=pd.read_csv('student3.tsv', sep='\t')

In [92]:
df3

  roll\tname\tclass\tmarks\tage
0        1\tanil\tTE\t56.77\t22
1        2\tamit\tTE\t59.77\t21
2      3\taniket\tBE\t76.88\t19
3     4\tajinkya\tTE\t69.66\t20
4        5\tasha\tTE\t63.28\t20
5      6\tayesha\tBE\t49.55\t20
6        7\tamar\tBE\t65.34\t19
7       8\tamita\tBE\t68.33\t23
8        9\tamol\tTE\t56.75\t20
9      10\tanmol\tBE\t78.66\t21

In [98]:
!pip install openpyxl

Requirement already satisfied: openpyxl in c:\users\itekhar\appdata\local\programs\python\python312\lib\site-packages (3.1.2)
Requirement already satisfied: et-xmlfile in c:\users\itekhar\appdata\local\programs\python\python312\lib\site-packages (from openpyxl) (1.1.0)

In [99]:
dfx=pd.read_excel('student.xlsx')

In [100]:
df.shape

(10, 5)

In [101]:
df.size

50

In [102]:
df.columns

Index(['roll', 'name', 'class', 'marks', 'age'], dtype='object')

In [104]:
df.dtypes

roll       int64
name      object
class     object
marks    float64
age        int64
dtype: object

In [106]:
df.index

RangeIndex(start=0, stop=10, step=1)

In [107]:
df.T

,0,1,2,3,4,5,6,7,8,9
roll,1,2,3,4,5,6,7,8,9,10
name,anil,amit,aniket,ajinkya,asha,ayesha,amar,amita,amol,anmol
class,TE,TE,BE,TE,TE,BE,BE,BE,TE,BE
marks,56.77,59.77,76.88,69.66,63.28,49.55,65.34,68.33,56.75,78.66
age,22,21,19,20,20,20,19,23,20,21

In [108]:
### function or methods

In [109]:
df.head()

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20

In [110]:
df.head(3)

   roll    name class  marks  age
0     1    anil    TE  56.77   22
1     2    amit    TE  59.77   21
2     3  aniket    BE  76.88   19

In [111]:
df.tail()

   roll    name class  marks  age
5     6  ayesha    BE  49.55   20
6     7    amar    BE  65.34   19
7     8   amita    BE  68.33   23
8     9    amol    TE  56.75   20
9    10   anmol    BE  78.66   21